/*
#     ___  _ _      ___
#    |    | | |    |
# ___|    |   | ___|    PS2DEV Open Source Project.
#----------------------------------------------------------
# Copyright (C) 2004 Gildas Bazin <gbazin@videolan.org>
# This file WAS part of dtsdec, a free DTS Coherent Acoustics stream decoder.
# See http://www.videolan.org/dtsdec.html for updates.
# Licensed (like the original dtsdec source code) under the terms of the
# GNU Lesser General Public License as published by the Free Software Foundation;
# either version 2 of the License, or (at your option) any later version.
#
# Adopded for SMS and optimized for Emotion Engine in 2007 by Eugene Plotnikov
#
*/
#include "SMS_DTS.h"
#include "SMS_Config.h"

#include <malloc.h>
#include <string.h>
#include <stdio.h>

#define BUFFER_SIZE 24576
#define HEADER_SIZE 14

#define DTS_PRIM_CHANNELS_MAX  5
#define DTS_ABITS_MAX         32
#define DTS_SUBBANDS          32
#define DTS_SUBSUBFAMES_MAX    4
#define DTS_LFE_MAX            3

#define DTS_LFE          0x80
#define DTS_CHANNEL_MASK 0x3F
#define DTS_CHANNEL_BITS 6

#define DTS_MONO    0
#define DTS_CHANNEL 1
#define DTS_STEREO  2
#define DTS_3F      5
#define DTS_2F1R    6
#define DTS_3F1R    7
#define DTS_2F2R    8
#define DTS_3F2R    9
#define DTS_4F2R    10
#define DTS_DOLBY   101

#define LEVEL_3DB     0.707107F
#define LEVEL_PLUS3DB 1.414214F
#define LEVEL_6DB     0.500000F
#define LEVEL_PLUS6DB 2.000000F

#define DTS_ADJUST_LEVEL 0x100

#define CONVERT( acmod, output ) (   (  ( output ) << DTS_CHANNEL_BITS  ) + ( acmod )   )

#define MUL_C( a, b ) (  ( a ) * ( b )  )
#define MUL_L( a, b ) (  ( a ) * ( b )  )
#define DIV( a, b )   (  ( a ) / ( b )  )
#define LEVEL( x )    ( x )

typedef struct huff_entry_s {
 unsigned char  length;
 unsigned short code;
 unsigned char  value;
} huff_entry_t;

typedef struct dts_state_t {
 float          clev;                            /*  0 */
 float          slev;                            /*  4 */
 float          level;                           /*  8 */
 float          bias;                            /* 12 */
 unsigned int*  buffer_start;                    /* 16 */
 unsigned int   current_word;                    /* 20 */
 unsigned char  bits_left;                       /* 24 */
 unsigned char  word_mode;                       /* 25 */
 unsigned char  bigendian_mode;                  /* 26 */
 unsigned char  prim_channels;                   /* 27 */
 int            dynrnge;                         /* 28 */
 float          dynrng;                          /* 32 */
 void*          dynrngdata;                      /* 36 */
 float          ( *dynrngcall )( float, void* ); /* 40 */
 int            bit_rate;                        /* 44 */
 unsigned char  current_subframe;                /* 48 */
 unsigned char  subframes;                       /* 49 */
 unsigned char  current_subsubframe;             /* 50 */
 unsigned char  subsubframes;                    /* 51 */
 unsigned char  multirate_inter;                 /* 52 */
 unsigned char  lfe;                             /* 53 */
 unsigned char  aspf;                            /* 54 */
 unsigned char  aux_data;                        /* 55 */
 unsigned char  predictor_history;               /* 56 */
 unsigned char  dynrange;                        /* 57 */
 unsigned char  downmix;                         /* 58 */
 unsigned char  timestamp;                       /* 59 */
 unsigned char  crc_present;                     /* 60 */
 unsigned char  sample_blocks;                   /* 61 */
 unsigned char  amode;                           /* 62 */
 char           output;                          /* 63 */
 float          samples             [ 3072 ];    /* 64 */
 float          lfe_data            [ 2 * DTS_SUBSUBFAMES_MAX * DTS_LFE_MAX * 2 ];
 float          subband_samples_hist[ DTS_PRIM_CHANNELS_MAX ][ 4 ][ DTS_SUBBANDS ];
 float          subband_fir_hist    [ DTS_PRIM_CHANNELS_MAX ][ 512 ];
 float          subband_fir_noidea  [ DTS_PRIM_CHANNELS_MAX ][ 64 ];
 float          scalefactor_adj     [ DTS_PRIM_CHANNELS_MAX ][ DTS_ABITS_MAX ];
 int            transition_mode     [ DTS_PRIM_CHANNELS_MAX ][ DTS_SUBBANDS ];
 int            scale_factor        [ DTS_PRIM_CHANNELS_MAX ][ DTS_SUBBANDS ][ 2 ];
 short          prediction_vq       [ DTS_PRIM_CHANNELS_MAX ][ DTS_SUBBANDS ];
 short          high_freq_vq        [ DTS_PRIM_CHANNELS_MAX ][ DTS_SUBBANDS ];
 unsigned char  subband_activity    [ DTS_PRIM_CHANNELS_MAX ];
 unsigned char  vq_start_subband    [ DTS_PRIM_CHANNELS_MAX ];
 unsigned char  joint_intensity     [ DTS_PRIM_CHANNELS_MAX ];
